leastsquares.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-08-12 Mon 21:58 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Least Squares</title>
<meta name="generator" content="Org mode">
<meta name="author" content="George Kontsevich">
<meta name="description" content="Some linear algebra in Clojure"
>
<link rel="stylesheet" type="text/css" href="../web/worg.css" />
<link rel="shortcut icon" href="../web/panda.svg" type="image/x-icon">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=".."> UP </a>
 |
 <a accesskey="H" href=".."> HOME </a>
</div><div id="content">
<h1 class="title">Least Squares</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org44792a4">The A<sup>T</sup>Ax=A<sup>T</sup>b form</a></li>
<li><a href="#orgfdc2250">The LU case</a>
<ul>
<li><a href="#orgac226d2">Direct method</a></li>
<li><a href="#org0c054d0">The numerically stable solution</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #0000FF;">ns</span> <span style="color: #6434A3;">morelinear.leastsquares</span>
  (<span style="color: #D0372D;">:require</span> [clojure.core.matrix <span style="color: #D0372D;">:refer</span> <span style="color: #D0372D;">:all</span><span style="color: #999999;">]</span>
            [clojure.core.matrix.linear <span style="color: #D0372D;">:as</span> linear<span style="color: #999999;">]</span>
            [morelinear.gauss <span style="color: #D0372D;">:as</span> gauss<span style="color: #999999;">]))</span>
(set-current-implementation <span style="color: #D0372D;">:vectorz</span>) 
</pre>
</div>

<div id="outline-container-org44792a4" class="outline-2">
<h2 id="org44792a4">The A<sup>T</sup>Ax=A<sup>T</sup>b form</h2>
<div class="outline-text-2" id="text-org44792a4">
<p>
Now that we have many ways to solve square linear systems we need to extend <b>Ax=b</b> to the overdefined case where we have more linear equations than parameters. This situation will come up constantly, generally in situations where you only have a few inputs you want to solve for, but you have a lot of redundant measurements. 
</p>

\begin{equation}
\begin{bmatrix}
a_11 & a_12\\
a_21 & a_22\\
a_31 & a_32\\
a_41 & a_42\\
...\\
\end{bmatrix}
\begin{bmatrix}
x_1\\
x_2\\
\end{bmatrix}
=
\begin{bmatrix}
y_1\\
y_2\\
\\
\end{bmatrix}
\end{equation}


<p>
If the measurements were ideal then the rows of <b>A</b> will not be independent and you will be able to find an explicit solution though Gaussian Elimination. But in the general case (with the addition of noise and rounding errors) no explicit solution will exist for <b>A<sub>skinny</sub>x=b</b> . You could try to find a set of independent equations and throw away the extra equation to try to make a square matrix, but this is throwing information away.
</p>

<p>
Since there is no <b>x</b> for which <b>A<sub>skinny</sub>x=b</b> holds true we instead solve for a "close" system <b>A<sub>skinny</sub>x=b<sub>close</sub></b> which does have a solution. In other words we want to find an <b>x</b> that will give us a <b>b<sub>close</sub></b> which is as close as possible to <b>b</b>. When we say "close" what we mean mathematically is that we want to minimize the sum of the difference between <b>b<sub>close</sub></b> and <b>b</b> - ie. <b>sum<sub>of</sub><sub>all</sub><sub>values</sub>(b<sub>close</sub>-b)</b>.
</p>

<p>
The problem is that sums don't express very easily in matrix form. Fortunately we do have a mechanism which is really close - the <b>inner product</b>. The inner product of a vector <b>x</b> with itself - <b>x<sup>T</sup>x</b> - is the sum of the squares of the values of <b>x</b>. While this is not equivalent, it actually does not change the solution b/c the minimum stays the minimum. So instead of  <b>sum<sub>of</sub><sub>all</sub><sub>values</sub>(b<sub>close</sub>-b)</b>. we can work with <b>(b<sub>close</sub>-b)<sup>T</sup>(b<sub>close</sub>-b)</b> and guarantee the same solution
</p>

<p>
If we plug in our equation for <b>b<sub>close</sub></b> for we get <b>(A<sub>skinny</sub>x-b)<sup>T</sup>(A<sub>skinny</sub>x-b)</b>. 
</p>

\begin{equation}
(A_{skinny}x-b)^{T}(A_{skinny}x-b) \\
((A_{skinny}x)^{T}-b^{T})(A_{skinny}x-b) \\
(x^{T}A_{skinny}^{T}-b^{T})(A_{skinny}x-b) \\
x^{T}A_{skinny}^{T}A_{skinny}x
-x^{T}A_{skinny}^{T}b
-b^{T}A_{skinny}x
+b^2
\end{equation}


<p>
As we learn in calculus, minimizing a function is done by take its derivative with respect to the parameter we are changing (here that's <code>x</code>), setting it equal to zero and then solving for that parameter (b/c the minimum point has zero slope). What <i>page 226-227</i> shows is that the derivative of our difference equation give us the equation <b>A<sup>T</sup>Ax=A<sup>T</sup>b</b>. The right hand side <b>A<sup>T</sup>b</b> is a vector, and in-fact the whole equation is in the form <b>Ax=b</b> which we know how to solve (again, solving for <code>x</code> here). Also note that <b>A<sup>T</sup>A</b> is always square and singlular - and that b/c <b>A</b> was skinny it's actually smaller than <b>A</b>.
</p>
</div>
</div>

<div id="outline-container-orgfdc2250" class="outline-2">
<h2 id="orgfdc2250">The LU case</h2>
<div class="outline-text-2" id="text-orgfdc2250">
</div>
<div id="outline-container-orgac226d2" class="outline-3">
<h3 id="orgac226d2">Direct method</h3>
<div class="outline-text-3" id="text-orgac226d2">
<p>
We take the product <b>A<sup>T</sup>A</b> and the product <b>A<sup>T</sup>b</b> and solve <b>A<sup>T</sup>Ax=A<sup>T</sup>b</b> just like we solve an <b>Ax=b</b> system
</p>
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #0000FF;">defn</span> <span style="color: #006699;">lu-direct</span>
  <span style="color: #036A07;">"Solve ATA=ATb directly"</span>
  [linear-system output-vector<span style="color: #999999;">]</span>
  (<span style="color: #0000FF;">let</span> [AT (transpose linear-system<span style="color: #999999;">)</span>
        ATA (mmul AT linear-system<span style="color: #999999;">)</span>
        ATb (mmul AT output-vector<span style="color: #999999;">)]</span>
    (<span style="color: #6434A3;">gauss</span>/solve-with-lu ATA ATb<span style="color: #999999;">)))</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">missile problem from page 232</span>
(<span style="color: #0000FF;">let</span> [A [[1.0 0.0 0.0<span style="color: #999999;">]</span>
         [1.0 0.25 0.0625<span style="color: #999999;">]</span>
         [1.0 0.50 0.25<span style="color: #999999;">]</span>
         [1.0 0.75 0.5625<span style="color: #999999;">]</span>
         [1.0 1.00 1.0<span style="color: #999999;">]]</span>
      b [0.000 0.008 0.015 0.019 0.02<span style="color: #999999;">]]</span>
  (lu-direct A b<span style="color: #999999;">))</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">(-2.2857142857142797E-4 0.03982857142857144 -0.019428571428571444)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0c054d0" class="outline-3">
<h3 id="org0c054d0">The numerically stable solution</h3>
<div class="outline-text-3" id="text-org0c054d0">
<p>
Unfortunately while the previous solutions is very simple, it does involve a matrix multiplication and therefore has some numerical issues. A nice trick is presented in <b>Exercise 4.6.9</b> with the equations
</p>

\begin{equation}
\begin{bmatrix}
I_{m*m} & A\\
A^T & 0_{n*n}\\
\end{bmatrix}
\begin{bmatrix}
x_1\\
x_2\\
\end{bmatrix}
=
\begin{bmatrix}
b\\
0\\
\end{bmatrix}
\end{equation}

<p>
This special block has the property that it'll always be square no matter what shape <b>A</b> is. If you multiply out the block matrices you will get two equations
</p>
\begin{equation}
\begin{bmatrix}
x_1+Ax_{2}\\
A^{T}x_{1}\\
\end{bmatrix}
=
\begin{bmatrix}
b\\
0\\
\end{bmatrix}
\end{equation}

\begin{equation}
x_1+Ax_{2} = b
\end{equation}

\begin{equation}
A^{T}x_{1} = 0
\end{equation}

<p>
Note how the second equation tell us <b>x<sub>1</sub></b> is in the <b>N(A<sup>T</sup>)</b>
</p>

<p>
Now we multiple both sides of our first equation by <b>A<sup>T</sup></b>
</p>

\begin{equation}
A^{T}(x_1+Ax_{2}) = A^{T}b
\end{equation}

\begin{equation}
A^{T}x_1+A^{T}Ax_{2} = A^{T}b
\end{equation}

\begin{equation}
A^{T}Ax_{2} = A^{T}b
\end{equation}

<p>
We just used the fact that <b>x<sub>1</sub></b> was in the nullspace of <b>A<sup>T</sup></b> to drop the first term and now we see how <b>x<sub>2</sub></b> is also a solution to the <i>least squares</i> equation
</p>

<p>
So we can use any method that works on solving square matrices, use it on our jumbo matrix and get a solution for the least squares problem. All without computing <b>A<sup>T</sup>A</b>.
</p>

<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #0000FF;">defn-</span> <span style="color: #006699;">jumbo-matrix</span>
  <span style="color: #036A07;">"Use the big block matrix method to compute the least squares solution"</span>
  [input-matrix<span style="color: #999999;">]</span>
  (<span style="color: #0000FF;">let</span> [num-rows (row-count input-matrix<span style="color: #999999;">)</span>
        num-columns (column-count input-matrix<span style="color: #999999;">)</span>
        identity (identity-matrix num-rows<span style="color: #999999;">)</span>
        AT (transpose input-matrix<span style="color: #999999;">)</span>
        zeroes (zero-matrix num-columns
                            num-columns<span style="color: #999999;">)]</span>
    (join-along 0
                (join-along 1
                            identity
                            input-matrix<span style="color: #999999;">)</span>
                (join-along 1
                            AT
                            zeroes<span style="color: #999999;">))))</span>

(<span style="color: #0000FF;">defn-</span> <span style="color: #006699;">pad-with-zeroes</span>
  <span style="color: #036A07;">"Takes the INPUT-VECTOR and make it longer with some zeroes padded on the end"</span>
  [input-vector number-of-zeroes<span style="color: #999999;">]</span>
  (join-along 0
              input-vector
              (zero-vector number-of-zeroes<span style="color: #999999;">)))</span>

(<span style="color: #0000FF;">defn</span> <span style="color: #006699;">lu-jumbo</span>
  <span style="color: #036A07;">""</span>
  [input-matrix output-vector<span style="color: #999999;">]</span>

  (subvector (<span style="color: #6434A3;">gauss</span>/solve-with-lu (jumbo-matrix input-matrix<span style="color: #999999;">)</span>
                                  (pad-with-zeroes output-vector
                                                   (column-count input-matrix<span style="color: #999999;">)))</span>
             (row-count input-matrix<span style="color: #999999;">)</span>
             (column-count input-matrix<span style="color: #999999;">)))</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">missile problem from page 232 but redone with the big matrix method</span>
(<span style="color: #0000FF;">let</span> [A [[1.0 0.0 0.0<span style="color: #999999;">]</span>
         [1.0 0.25 0.0625<span style="color: #999999;">]</span>
         [1.0 0.50 0.25<span style="color: #999999;">]</span>
         [1.0 0.75 0.5625<span style="color: #999999;">]</span>
         [1.0 1.00 1.0<span style="color: #999999;">]]</span>
      b [0.000 0.008 0.015 0.019 0.02<span style="color: #999999;">]]</span>
  (lu-jumbo A b<span style="color: #999999;">))</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">[-2.2857142857142797E-4 0.03982857142857144 -0.019428571428571444]</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
